# Naiive Bayes

In [88]:
import pandas as pd
df = pd.read_csv("C:/Users/Dell/OneDrive/Documents/machine_learning models/titanic.csv")
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [89]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis ='columns', inplace = True)

In [90]:
df.head(5)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [91]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

# create dummies because on sex column it is character , ml model will take number only as input

In [92]:
dummies = pd.get_dummies(inputs.Sex).astype(int)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

# joining tables for training

In [93]:
inputs = pd.concat([inputs,dummies], axis='columns')
inputs.head(5)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [94]:
inputs.drop('Sex', axis='columns', inplace=True)
inputs

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

## for checking data missing or NaN type..

In [95]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [96]:
target.isna().any()

False

In [97]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [110]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size = 0.2)

# Here i gonna use gaussian naive bayes ( we can choose model according to behaviour of dataset)

In [111]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [112]:
model.fit(X_train, y_train)

GaussianNB()

In [113]:
model.score(X_test, y_test)

0.8044692737430168

In [114]:
X_test[:10]

     Pclass        Age      Fare  female  male
811       3  39.000000   24.1500       0     1
54        1  65.000000   61.9792       0     1
888       3  29.699118   23.4500       1     0
459       3  29.699118    7.7500       0     1
622       3  20.000000   15.7417       0     1
775       3  18.000000    7.7500       0     1
32        3  29.699118    7.7500       1     0
309       1  30.000000   56.9292       1     0
505       1  18.000000  108.9000       0     1
392       3  28.000000    7.9250       0     1

In [115]:
model.predict(X_test[:10])

array([0, 0, 1, 0, 0, 0, 1, 1, 1, 0], dtype=int64)

In [118]:
y_test[:10]

811    0
54     0
888    0
459    0
622    1
775    0
32     1
309    1
505    0
392    0
Name: Survived, dtype: int64

In [119]:
model.predict_proba(X_test[:10])

array([[0.98940192, 0.01059808],
       [0.76824285, 0.23175715],
       [0.0969345 , 0.9030655 ],
       [0.9889843 , 0.0110157 ],
       [0.98771833, 0.01228167],
       [0.98695645, 0.01304355],
       [0.09803703, 0.90196297],
       [0.0057933 , 0.9942067 ],
       [0.11008693, 0.88991307],
       [0.9887993 , 0.0112007 ]])